NordicSemiconductor/nrfx/bsp/stable/mdk/iar_startup_nrf7120_enga_lmac.s
        PUBWEAK  VPRCLIC_18_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_18_IRQHandler
        j .

        PUBWEAK  VPRCLIC_19_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_19_IRQHandler
        j .

        PUBWEAK  VPRCLIC_20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_20_IRQHandler
        j .

        PUBWEAK  VPRCLIC_21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_21_IRQHandler
        j .

        PUBWEAK  VPRCLIC_22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_22_IRQHandler
        j .

        PUBWEAK  VPRCLIC_23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPRCLIC_23_IRQHandler
        j .

        PUBWEAK  UMAC_VPR_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
UMAC_VPR_IRQHandler
        j .

        PUBWEAK  MVDMA_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA_IRQHandler
        j .

        PUBWEAK  SERIAL00_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL00_IRQHandler
        j .

        PUBWEAK  SERIAL01_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL01_IRQHandler
        j .

        PUBWEAK  SERIAL20_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL20_IRQHandler
        j .

        PUBWEAK  SERIAL21_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL21_IRQHandler
        j .

        PUBWEAK  SERIAL22_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL22_IRQHandler
        j .

        PUBWEAK  GRTC_4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_4_IRQHandler
        j .

        PUBWEAK  SERIAL23_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL23_IRQHandler
        j .

        PUBWEAK  SERIAL24_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL24_IRQHandler
        j .

        PUBWEAK  SERIAL30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SERIAL30_IRQHandler
        j .

        END


